## Staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 8 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                      NAME                                      |
|----------|--------------------------------------------------------------------------------|
| update   | `aws_cloudwatch_metric_alarm.scan-files-document-download-bucket-size-warning` |
|          | `module.s3_scan_objects.aws_iam_policy.scan_files[0]`                          |
|          | `module.s3_scan_objects.aws_sqs_queue_policy.s3_scan_object`                   |
| recreate | `aws_s3_bucket.scan_files_document_bucket`                                     |
| add      | `aws_s3_bucket_public_access_block.scan_files_document_bucket`                 |
|          | `module.athena_logs_bucket.aws_s3_bucket_versioning.this`                      |
|          | `module.bulk_send_logs.aws_s3_bucket_versioning.this`                          |
|          | `module.csv_bucket_logs.aws_s3_bucket_versioning.this`                         |
|          | `module.document_download_logs.aws_s3_bucket_versioning.this`                  |
|          | `module.s3_scan_objects.aws_s3_bucket_notification.s3_scan_object`             |
|          | `module.s3_scan_objects.aws_s3_bucket_policy.upload_bucket[0]`                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.scan-files-document-download-bucket-size-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "scan-files-document-download-bucket-size-warning" {
      ~ dimensions                = {
          ~ "BucketName"  = "notification-canada-ca-staging-document-download-scan-files" -> "notification-canada-ca-staging-dd-scan-files"
            # (1 unchanged element hidden)
        }
        id                        = "scan-files-document-download-bucket-size-warning"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_s3_bucket.scan_files_document_bucket must be replaced
-/+ resource "aws_s3_bucket" "scan_files_document_bucket" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files" -> (known after apply)
      ~ bucket                      = "notification-canada-ca-staging-document-download-scan-files" -> "notification-canada-ca-staging-dd-scan-files" # forces replacement
      ~ bucket_domain_name          = "notification-canada-ca-staging-document-download-scan-files.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "notification-canada-ca-staging-document-download-scan-files.s3.ca-central-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z1QDHH18159H29" -> (known after apply)
      ~ id                          = "notification-canada-ca-staging-document-download-scan-files" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ca-central-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      - grant {
          - id          = "69e55cefe4e71d4930761796ca1b0184cad872eb794dd25fbfc366b4501a75f9" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      ~ lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
            id                                     = "tf-s3-lifecycle-all-files"
          - tags                                   = {} -> null
            # (1 unchanged attribute hidden)

          ~ expiration {
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }

      ~ logging {
            # (1 unchanged attribute hidden)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      ~ server_side_encryption_configuration {
          ~ rule {
              - bucket_key_enabled = false -> null

              ~ apply_server_side_encryption_by_default {
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.scan_files_document_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "scan_files_document_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.athena_logs_bucket.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = "notification-canada-ca-staging-athena-logs"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.bulk_send_logs.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = "notification-canada-ca-staging-bulk-send-logs"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.csv_bucket_logs.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = "notification-canada-ca-staging-csv-upload-logs"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.document_download_logs.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = "notification-canada-ca-staging-document-download-logs"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.limit_tagging[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "limit_tagging"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObjectTagging",
              + "s3:DeleteObjectVersionTagging",
              + "s3:PutObjectTagging",
              + "s3:PutObjectVersionTagging",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringNotLike"
              + values   = [
                  + "arn:aws:iam::239043911459:role/ScanFilesGetObjects",
                ]
              + variable = "aws:PrincipalArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObjectTagging",
              + "s3:PutObjectVersionTagging",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::239043911459:role/ScanFilesGetObjects",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.s3_scan_object will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_scan_object"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:ca-central-1:239043911459:s3-scan-object",
            ]
          + sid       = "S3sendToSQS"

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "s3.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:ca-central-1:239043911459:s3-scan-object",
            ]
          + sid       = "LambdaTriggerFromSQS"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::806545929748:role/s3-scan-object",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.scan_files[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scan_files"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObjectTagging",
              + "s3:DeleteObjectVersionTagging",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:GetObjectTagging",
              + "s3:GetObjectVersion",
              + "s3:GetObjectVersionTagging",
              + "s3:ListBucket",
              + "s3:PutObjectTagging",
              + "s3:PutObjectVersionTagging",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.scan_files_download[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scan_files_download"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:GetObjectTagging",
              + "s3:GetObjectVersion",
              + "s3:GetObjectVersionTagging",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::239043911459:role/ScanFilesGetObjects",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.upload_bucket[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "upload_bucket"  {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
        ]
    }

  # module.s3_scan_objects.aws_iam_policy.scan_files[0] will be updated in-place
  ~ resource "aws_iam_policy" "scan_files" {
        id        = "arn:aws:iam::239043911459:policy/ScanFilesGetObjects"
        name      = "ScanFilesGetObjects"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObjectVersionTagging",
                          - "s3:PutObjectTagging",
                          - "s3:ListBucket",
                          - "s3:GetObjectVersionTagging",
                          - "s3:GetObjectVersion",
                          - "s3:GetObjectTagging",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObjectVersionTagging",
                          - "s3:DeleteObjectTagging",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.s3_scan_objects.aws_s3_bucket_notification.s3_scan_object will be created
  + resource "aws_s3_bucket_notification" "s3_scan_object" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)

      + queue {
          + events    = [
              + "s3:ObjectCreated:*",
            ]
          + id        = "ScanObjectCreated"
          + queue_arn = "arn:aws:sqs:ca-central-1:239043911459:s3-scan-object"
        }
    }

  # module.s3_scan_objects.aws_s3_bucket_policy.upload_bucket[0] will be created
  + resource "aws_s3_bucket_policy" "upload_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3_scan_objects.aws_sqs_queue_policy.s3_scan_object will be updated in-place
  ~ resource "aws_sqs_queue_policy" "s3_scan_object" {
        id        = "https://sqs.ca-central-1.amazonaws.com/239043911459/s3-scan-object"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnEquals = {
                              - aws:SourceArn = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "s3.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:ca-central-1:239043911459:s3-scan-object"
                      - Sid       = "S3sendToSQS"
                    },
                  - {
                      - Action    = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::806545929748:role/s3-scan-object"
                        }
                      - Resource  = "arn:aws:sqs:ca-central-1:239043911459:s3-scan-object"
                      - Sid       = "LambdaTriggerFromSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 8 to add, 3 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 57 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
